---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryDir2WithSpacing
source: html/eff452d1-a3ea-f180-6d0a-7987da880c34.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryDir2WithSpacing Property

"Minor, Both Faces"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemLayerSummaryDir2WithSpacing { get; }
```